<details ><summary>plan for staging 2025-04-03 09:16:44 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project kahnwong/digger-demo#staging has been locked by PR #5
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_uuid   = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |      RESOURCE      |
|--------|--------------------|
| add    | `random_uuid.uuid` |

| CHANGE |    OUTPUT     |
|--------|---------------|
| add    | `random_uuid` |

</details>

</details>